bouffalolab/bl_iot_sdk/customer_app/bl702_demo_event/bl702_demo_event/main.c
    if(argc != EXPECTED_PARA_CNT)
    {
        printf("Wrong number of args\r\n");
        printf("zb_bdb_set_channel_set <srcEp>\r\n"
                "primaryChannelSet - <uint32_t>\r\n"
                "secondaryChannelSet - <uint32_t>\r\n");
        return;
    }
    else
    {   
        get_uint32_from_string(&argv[para_cnt++], &primaryChannelSet);
        get_uint32_from_string(&argv[para_cnt++], &secondaryChannelSet);
        ret = zb_bdb_setChannelSet(primaryChannelSet, secondaryChannelSet);
        if(ret)
        {
            printf("%s fails to set bdbChannelSet with error code(0x%lx)\r\n", __func__, ret);
        }
    }
}

void  zb_bdb_appCb(struct _zbBdbCbMsg *cbMsg)
{
    printf("%s: msgType 0x%x, status 0x%x, bindCnt %d\r\n", __func__, cbMsg->msgType, cbMsg->status, cbMsg->bindCnt);    
}

void zbcli_bdb_start_Fb_Initiator(char* pcWriteBuffer, int xWriteBufferLen, int argc, char** argv)
{
    uint8_t para_cnt = PRE_CLI_PARAM_NUM;
    uint8_t srcEp;
    uint8_t commissionMode;
    uint16_t groupId;
    const uint8_t EXPECTED_PARA_CNT = PRE_CLI_PARAM_NUM + 2;

    if(argc != EXPECTED_PARA_CNT)
    {
        printf("Wrong number of args\r\n");
        printf("zb_bdb_start_Fb_Initiator <srcEp,groupId>\r\n"
                "srcEp - <uint8_t>\r\n"
                "groupId - <uint16_t>group id \r\n");
        return;
    }
    else
    {   
        get_uint8_from_string(&argv[para_cnt++], &srcEp);
        get_uint16_from_string(&argv[para_cnt++], &groupId);
        zb_bdb_startFindBindInitiator(srcEp, groupId, zb_bdb_appCb);
    }
}

void zbcli_bdb_fb_start_target(char* pcWriteBuffer, int xWriteBufferLen, int argc, char** argv)
{
    uint8_t para_cnt = PRE_CLI_PARAM_NUM;
    uint8_t ep;
    uint16_t identifyTimeInSec;
    const uint8_t EXPECTED_PARA_CNT = PRE_CLI_PARAM_NUM + 2;

    if(argc != EXPECTED_PARA_CNT)
    {
        printf("Wrong number of args\r\n");
        printf("zb_bdb_fb_target <srcEp, identifyTimeInSec>\r\n"
                "srcEp - <uint8_t>\r\n"
                "identifyTimeInSec - <uint16_t>\r\n");
        return;
    }
    else
    {   
        get_uint8_from_string(&argv[para_cnt++], &ep);
        get_uint16_from_string(&argv[para_cnt++], &identifyTimeInSec);
        zb_bdb_startFindBindTarget(ep, identifyTimeInSec, zb_bdb_appCb);
    }
}

void zbcli_bdb_nwk_form(char* pcWriteBuffer, int xWriteBufferLen, int argc, char** argv)
{
    const uint8_t EXPECTED_PARA_CNT = PRE_CLI_PARAM_NUM;

    if(argc != EXPECTED_PARA_CNT)
    {
        printf("Wrong number of args\r\n");
        printf("zb_bdb_nwk_form <void>\r\n");
        return;
    }
    else
    {   
        zb_bdb_nwkForm(zb_bdb_appCb);
    }
}

void zbcli_bdb_nwk_steer(char* pcWriteBuffer, int xWriteBufferLen, int argc, char** argv)
{
    const uint8_t EXPECTED_PARA_CNT = PRE_CLI_PARAM_NUM;

    if(argc != EXPECTED_PARA_CNT)
    {
        printf("Wrong number of args\r\n");
        printf("zb_bdb_nwk_steer <void>\r\n");
        return;
    }
    else
    {   
        zb_bdb_nwkSteer(zb_bdb_appCb);
    }
}

#endif

const static struct cli_command cmds_user[] STATIC_CLI_CMD_ATTRIBUTE = { 
        {"pds_start", "enable or disable pds", cmd_start_pds},
        {"lw_cfg", "lowpower configuration for active current test", cmd_lowpower_config},
        {"aligntc", "align case test", cmd_align},
        #if defined(CONFIG_ZIGBEE_PROV)
        { "blsync_blezb_start", "start zigbee provisioning via ble", cmd_blsync_blezb_start},
        #endif
        { "wdt_set", "enable or disable pds", cmd_wdt_set},
        #if defined(CFG_ZIGBEE_ENABLE)
        //bdb
        { "zb_bdb_local_default_report_cfg",  "bdb local default report ", zbcli_bdb_local_default_report_cfg},
        { "zb_bdb_set_channel_set",  "bdb set channel set", zbcli_bdb_set_channel_set},
        { "zb_bdb_start_fb_initiator",  "bdb start fb initiator", zbcli_bdb_start_Fb_Initiator},
        { "zb_bdb_start_fb_target",  "bdb start fb target", zbcli_bdb_fb_start_target},
        { "zb_bdb_nwk_form",  "bdb nwk formation", zbcli_bdb_nwk_form},
        { "zb_bdb_nwk_steer",  "bdb nwk steering", zbcli_bdb_nwk_steer},
        #endif
};

void vApplicationStackOverflowHook(TaskHandle_t xTask, char *pcTaskName )
{
    puts("Stack Overflow checked\r\n");
	if(pcTaskName){
		printf("Stack name %s\r\n", pcTaskName);
	}
    while (1) {
        /*empty here*/
    }
}

void vApplicationMallocFailedHook(void)
{
    printf("Memory Allocate Failed. Current left size is %d bytes\r\n"
#if defined(CFG_USE_PSRAM)
        "Current psram left size is %d bytes\r\n"
#endif /*CFG_USE_PSRAM*/
        ,xPortGetFreeHeapSize()
#if defined(CFG_USE_PSRAM)
        ,xPortGetFreeHeapSizePsram()
#endif /*CFG_USE_PSRAM*/
    );
    while (1) {
        /*empty here*/
    }
}

void vApplicationIdleHook(void)
{
    bl_wdt_feed();

    if(!pds_start){
        __asm volatile(
                "   wfi     "
        );
        /*empty*/
    }
}

#if 0
void vApplicationSleep( TickType_t xExpectedIdleTime)
{
    static uint32_t ticks = 0;
    uint32_t cnt = xTaskGetTickCount();
    
    if( (cnt - ticks > 1000) && (xExpectedIdleTime > 20) ){
      ticks = cnt;
      printf("Idle Time: %u\r\n", (unsigned int)xExpectedIdleTime);
      BL702_Delay_MS(1);
      /* Enter pds level 1 for 10ms */
    #if 0
      hal_pds_enter_without_time_compensation(31, 32768/100);
      uint32_t sync = 0;//bl_sys_time_sync();
    #else
    /*Disable mtimer interrrupt*/
    *(volatile uint8_t*)configCLIC_TIMER_ENABLE_ADDRESS = 0;
    uint32_t sync = hal_pds_enter_with_time_compensation(31, 32768*10);
    *(volatile uint8_t*)configCLIC_TIMER_ENABLE_ADDRESS = 1;
    bl_uart_init(0, 14, 15, 255, 255, 2 * 1000 * 1000);
    #endif
    printf("%u ticks compensated\r\n", (unsigned int)sync);
    }
}
#endif

static void bl702_low_power_config(void)
{
#if !defined(CFG_USB_CDC_ENABLE)
    // Power off DLL
    GLB_Power_Off_DLL();
#endif
    
    // Disable secure engine
    Sec_Eng_Trng_Disable();
    SEC_Eng_Turn_Off_Sec_Ring();
    
#if !defined(CFG_BLE_ENABLE)
    // if ble is not enabled, Disable BLE clock
    GLB_Set_BLE_CLK(0);
#endif
#if !defined(CFG_ZIGBEE_ENABLE)
    // if zigbee is not enabled, Disable Zigbee clock
    GLB_Set_MAC154_ZIGBEE_CLK(0);
#endif
    
    // Gate peripheral clock
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, 0x00214BC3);
}

void bl_pds_restore(void)
{
    bl702_low_power_config();
    hosal_uart_init(&uart_stdio);

#if defined(CFG_USB_CDC_ENABLE)
    extern void usb_cdc_restore(void);
    usb_cdc_restore();
#endif

#if defined(CFG_BLE_PDS)
    ble_controller_sleep_restore();
   // bl_sec_init();
#endif
}

//For test
extern int32_t rwip_get_sleep_stat_cnt(void);
//end
#if ( configUSE_TICKLESS_IDLE != 0 )
#if defined(CFG_BLE_PDS)
extern bool le_check_valid_scan(void);
extern bool le_check_valid_conn(void);
//Allocate retention memory
void *bl_alloc_retmem(size_t xWantedSize )
{
    return pvPortMalloc(xWantedSize);    
}

void vApplicationSleep( TickType_t xExpectedIdleTime_ms)
{
    int32_t bleSleepDuration_32768cycles = 0;
    int32_t expectedIdleTime_32768cycles = 0;
    eSleepModeStatus eSleepStatus;
    bool freertos_max_idle = false;
    #if (LE_PDS_FLASH)
    uint8_t ioMode;
    uint8_t contRead; 
    #endif

    if (pds_start == 0 || le_check_valid_scan())
        return;

    if(xExpectedIdleTime_ms + xTaskGetTickCount() == portMAX_DELAY){
        freertos_max_idle = true;
    }else{   
        xExpectedIdleTime_ms -= 1;
        expectedIdleTime_32768cycles = 32768 * xExpectedIdleTime_ms / 1000;
    }

