bouffalolab/bl_iot_sdk/customer_app/bl702_demo_event/bl702_demo_event/main.c
    if((!freertos_max_idle)&&(expectedIdleTime_32768cycles < TIME_5MS_IN_32768CYCLE)){
        return;
    }
        
    eSleepStatus = eTaskConfirmSleepModeStatus();
    if(eSleepStatus == eAbortSleep || ble_controller_sleep_is_ongoing())
    {
        return;
    }

    bleSleepDuration_32768cycles = ble_controller_sleep();

    if(bleSleepDuration_32768cycles < TIME_5MS_IN_32768CYCLE)
    {
        return;
    }
    else
    { 
        printf("Sleep_cycles=%ld,state_cnt=%d\r\n", bleSleepDuration_32768cycles, rwip_get_sleep_stat_cnt());
        uint8_t reduceSleepTime;
        SPI_Flash_Cfg_Type *flashCfg = bl_flash_get_flashCfg();
        uint8_t ioMode =  flashCfg->ioMode & 0xF;
        uint8_t contRead = flashCfg->cReadSupport;
        uint8_t cpuClk = GLB_Get_Root_CLK_Sel();
        if(ioMode == 4 && contRead == 1 && cpuClk == GLB_ROOT_CLK_XTAL)
        {
           reduceSleepTime = 100;
        }
        else if(ioMode == 1 && contRead == 0 && cpuClk == GLB_ROOT_CLK_XTAL)
        {
           reduceSleepTime = 130;
        }
        else
        {
           reduceSleepTime = 130;
        }
        printf("reduceSleepTime=%d\r\n",reduceSleepTime);
        if(eSleepStatus == eStandardSleep && ((!freertos_max_idle) && (expectedIdleTime_32768cycles < bleSleepDuration_32768cycles)))
        {
           hal_pds_enter_with_time_compensation(31, expectedIdleTime_32768cycles - reduceSleepTime);
        }
        else
        {
           hal_pds_enter_with_time_compensation(31, bleSleepDuration_32768cycles - reduceSleepTime);
        }
        
        bl_timer_init();
        bl_pds_restore();
    }
}
#elif defined(CFG_ZIGBEE_PDS)
void vApplicationSleep( TickType_t xExpectedIdleTime )
{
    uint32_t xActualIdleTime = 0;
    eSleepModeStatus eSleepStatus;
    uint32_t sleepTime;
    uint32_t sleepCycles;
    
#define PDS_TOLERANCE_TIME_MS    5
//in driver, it takes (sleep_cycles-PDS_WARMUP_LATENCY_CNT) as sleep cycles. Make sure pds sleep for at least 1 ms(about 31cycles).
#define PDS_MIN_TIME_MS    (PDS_WARMUP_LATENCY_CNT + 30 + 31)/31 
    
    if(pds_start == 0){
        return;
    }

    eSleepStatus = eTaskConfirmSleepModeStatus();
    if(eSleepStatus == eAbortSleep){
        printf("eSleepStatus == eAbortSleep\r\n");
        return;
    }else if(eSleepStatus == eStandardSleep){
        if(xExpectedIdleTime <= PDS_TOLERANCE_TIME_MS + PDS_MIN_TIME_MS){
            return;
        }
    }
    
#if defined(CFG_ZIGBEE_PDS)
    if(!zb_stackIdle())
    {
        return;
    }

    xActualIdleTime = zb_zedGetIdleDuration() / 1000;
#endif
    if(xActualIdleTime <= PDS_TOLERANCE_TIME_MS + PDS_MIN_TIME_MS){
        return;
    }
    
   if(eSleepStatus == eStandardSleep){
        if(xExpectedIdleTime < xActualIdleTime){
            sleepTime = xExpectedIdleTime - PDS_TOLERANCE_TIME_MS;
        }else{
            sleepTime = xActualIdleTime - PDS_TOLERANCE_TIME_MS;
        }
    }else{
        sleepTime = xActualIdleTime - PDS_TOLERANCE_TIME_MS;
    }

    bl_irq_disable(M154_IRQn);
    printf("[%lu] will sleep: %lu ms\r\n", (uint32_t)bl_rtc_get_timestamp_ms(), sleepTime);
    
#if defined(CFG_ZIGBEE_PDS)
    zb_zedStoreRegs();
    zb_zedStoreTime();
#endif
    sleepCycles = (uint64_t)32768 * sleepTime / 1000;
    sleepTime = hal_pds_enter_with_time_compensation(31, sleepCycles);
    bl_pds_restore();
   
#if defined(CFG_ZIGBEE_PDS)   
    zb_zedRestoreRegs();
    zb_zedRestoreTime(sleepTime * 1000);
#endif
    
    printf("[%lu] actually sleep: %lu ms\r\n", (uint32_t)bl_rtc_get_timestamp_ms(), sleepTime);
}

#else
void vApplicationSleep( TickType_t xExpectedIdleTime )
{
    
}
#endif
#endif

#if ( configUSE_TICK_HOOK != 0 )
void vApplicationTickHook( void )
{
#if defined(CFG_USB_CDC_ENABLE)
    extern void usb_cdc_monitor(void);
    usb_cdc_monitor();
#endif
#if defined(CFG_ZIGBEE_ENABLE)
	extern void ZB_MONITOR(void);
	ZB_MONITOR();
#endif
}
#endif

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize)
{
    /* If the buffers to be provided to the Idle task are declared inside this
    function then they must be declared static - otherwise they will be allocated on
    the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    //static StackType_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];
    static StackType_t uxIdleTaskStack[256];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle task's
    state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
    Note that, as the array is necessarily of type StackType_t,
    configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    //*pulIdleTaskStackSize = configMINIMAL_STACK_SIZE; 
    *pulIdleTaskStackSize = 256;//size 256 words is For ble pds mode, otherwise stack overflow of idle task will happen.
}

/* configSUPPORT_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the
application must provide an implementation of vApplicationGetTimerTaskMemory()
to provide the memory that is used by the Timer service task. */
void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer, StackType_t **ppxTimerTaskStackBuffer, uint32_t *pulTimerTaskStackSize)
{
    /* If the buffers to be provided to the Timer task are declared inside this
    function then they must be declared static - otherwise they will be allocated on
    the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[ configTIMER_TASK_STACK_DEPTH ];

    /* Pass out a pointer to the StaticTask_t structure in which the Timer
    task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
    Note that, as the array is necessarily of type StackType_t,
    configTIMER_TASK_STACK_DEPTH is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}

void user_vAssertCalled(void) __attribute__ ((weak, alias ("vAssertCalled")));
void vAssertCalled(void)
{
    taskDISABLE_INTERRUPTS();

